{
    "content": "ZAHID AHMAD\nMACHINE LEARNING ENGINEER\nMail: zahidonbusiness@gmail.com\nPhone Number: (+92) 3185362004\nDate of Birth: January 1, 2002\nLinkedIn: https://www.linkedin.com/in/zahid-ahmad-886457215/\nGitHub: https://github.com/zahid-ahmad\nPortfolio: https://zahid-ahmad.github.io/\nWORK EXPERIENCE\nAssociate Machine Learning Engineer | VOIPMEN, Lahore | Hybrid\nOctober 2024 - Present\n- Developed rule-based and generative chatbots capable of handling 5,000 simultaneous calls on a single GPU, and performed Call Detail Record (CDR) analysis to optimize customer engagement and increase customer acquisition.\nMachine Learning Engineer | Kins247 Islamabad\nMarch 2024 - January 2025\n- Created datasets and NLP models from scratch, developed voice-calling chatbots using NLP and Transformers, engineered APIs for LLM integration, fine-tuned and quantized LLMs to optimize performance and reduce latency to 0.5 seconds, deployed multi-request handling chatbots, implemented Retrieval-Augmented Generation (RAG) for enhanced QAs, utilized CUDA programming on NVIDIA GPUs for efficient model training, and applied computer vision techniques to classify audio files from spectrograms.\nMachine Learning Engineer Freelancer | Fiverr Platform\nJanuary 1, 2023 - March, 2024 (1 year)\n- Worked on multiple Machine Learning, Deep Learning, Computer Vision, Web/Mobile app and Natural Language Processing projects.\nEDUCATION\nBachelors of Science in Artificial Intelligence (CGPA 3.60 out of 4.0)\nIslamia University of Bahawalpur, Pakistan\nJanuary, 2020 - January, 2024\nPORTFOLIO\n- Journal Paper \"Deep Learning for Uniform Detection A CNN-based Approach\" (Submitted in SN Applied Sciences Journal- IF 2.6) Tanzeel Abbas, Zahid Ahmad.\nPROJECTS\n1. AI based Smart Yoga Trainer + Object Detection (Final Year Project)\n- The system utilizes a webcam to take input image, Detect human and compares the user's yoga pose with a pre-existing target image in the system by pose estimation using Computer Vision, and provides real-time feedback, scores, and personalized instructions for an optimized yoga experience using trained Machine Learning model.\n2. Cotton disease Detection and Prevention Using CNN. (Presented at ICMPAI (International Conference on Machine Perception and AI Expo 2022 WINNER)\n- Detects diseases and types of cotton disease and suggest steps and medicine prescriptions to get cure. Trained on free T4 GPU of Google Colab using Keras for 1.5 hours, time reduced by 3 hours.\n- Created API using Flask. More projects on GitHub\nSKILLS AND ACHIEVEMENTS\nProgramming Languages\n- Python, C++, C\n- Libraries/Frameworks: OpenCV, Darknet, Tensorflow/Keras, Pytorch, NLTK, Flask, GitHub, Matplotlib, Langchain, Pandas, NumPy, face_recognition, HuggingFace, Streamlit, Scikit Learn, Seaborn, AWS Sagemaker, Azure.\nGeneral Software Skills and Tools\n- SciPy, Grad-CAM, Media-pipe, MATLAB, vLLM, Ollama. Data Scraping, Data Collection and Dataset Creation.\n- Git and GitHub, MS Excel, AI Environments, Jupyter Notebook, CUDA Programming, Google Colab, Visual Studio Code, Linux servers, AI Model Performance analysis, distributed computing for AI.\n- Large Language Models (LLMs), Generative AI, API development, MLOps,\nAchievements\n- RUNNER UP of Artificial Intelligence Expo 2022 at The Islamia University of Bahawalpur, Pakistan.\n- Awarded with laptop for good academic performance by Government of Pakistan.\n- Awarded with merit scholarship by Islamia University of Bahawalpur.\nCOURSES\nCrash Course on Python, Coursera\nSeptember 2021 - December 2021 (03 Months)\nDeep Learning Essentials with Keras, Coursera\nDecember 2022 - February 2023 (03 Months)\nIBM AI Engineering professional certificate, Coursera\nJanuary 2023 - July 2023 (06 months)\nAdvanced Computer Vision and Deep Learning Certificate, Coursera\nData Science and Business Intelligence, NAVTTC Pakistan\nJune 2023 - September 2023 (03 Months)"
}